In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [1]:
from sklearn.metrics import classification_report,r2_score,mean_squared_error
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor

In [3]:
data=pd.read_csv('/content/drive/MyDrive/My Codes and data/DataSets/insurance.csv')
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
from sklearn.preprocessing import OneHotEncoder,LabelEncoder

In [6]:
ohe=OneHotEncoder()
le=LabelEncoder()

In [7]:
data['region']=le.fit_transform(data['region'])
data.head()

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes       3  16884.92400
1   18    male  33.770         1     no       2   1725.55230
2   28    male  33.000         3     no       2   4449.46200
3   33    male  22.705         0     no       1  21984.47061
4   32    male  28.880         0     no       1   3866.85520

In [8]:
a=pd.get_dummies(data['sex'],drop_first=True)
a.head()

   male
0     0
1     1
2     1
3     1
4     1

In [9]:
b=pd.get_dummies(data['smoker'],drop_first=True)
b.head()

   yes
0    1
1    0
2    0
3    0
4    0

In [10]:
b.columns=['Smoker']

In [11]:
b.head()

   Smoker
0       1
1       0
2       0
3       0
4       0

In [12]:
data=pd.concat([data,a,b],axis=1)
data.head()

   age     sex     bmi  children smoker  region      charges  male  Smoker
0   19  female  27.900         0    yes       3  16884.92400     0       1
1   18    male  33.770         1     no       2   1725.55230     1       0
2   28    male  33.000         3     no       2   4449.46200     1       0
3   33    male  22.705         0     no       1  21984.47061     1       0
4   32    male  28.880         0     no       1   3866.85520     1       0

In [13]:
data.drop(['sex','smoker'],axis=1,inplace=True)
data.head()

   age     bmi  children  region      charges  male  Smoker
0   19  27.900         0       3  16884.92400     0       1
1   18  33.770         1       2   1725.55230     1       0
2   28  33.000         3       2   4449.46200     1       0
3   33  22.705         0       1  21984.47061     1       0
4   32  28.880         0       1   3866.85520     1       0

In [15]:
data.drop('region',axis=1,inplace=True)
data.head()

   age     bmi  children      charges  male  Smoker
0   19  27.900         0  16884.92400     0       1
1   18  33.770         1   1725.55230     1       0
2   28  33.000         3   4449.46200     1       0
3   33  22.705         0  21984.47061     1       0
4   32  28.880         0   3866.85520     1       0

In [16]:
X=data.drop('charges',axis=1)
y=data['charges']
X.shape,y.shape

((1338, 5), (1338,))

In [17]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3)

In [18]:
linear_regresor=LinearRegression()
linear_regresor.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [21]:
y_pred1=linear_regresor.predict(X_test)
print(mean_squared_error(y_test,y_pred1))
print(r2_score(y_test,y_pred1))

37456300.56190844
0.7277882986209446

In [22]:
model=RandomForestRegressor()
model.fit(X_train,y_train)
y_pred2=model.predict(X_test)

In [23]:
print(r2_score(y_test,y_pred2))

0.8097813506844638

In [25]:
import joblib
joblib.dump(model,'model.pkl')

['model.pkl']